#### ❌ Terragrunt Plan
<details><summary>Show Plan</summary>

```
time=2026-01-08T23:51:11Z level=info msg=The stack at /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod will be processed in the following order for command plan:
Group 1
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace-secondary

Group 2
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base-secondary

Group 3
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps-secondary



Initializing the backend...

Initializing the backend...

Successfully configured the backend "gcs"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "gcs"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- terraform.io/builtin/terraform is built in to OpenTofu
- Reusing previous version of rackerlabs/spot from the dependency lock file

Initializing provider plugins...
- terraform.io/builtin/terraform is built in to OpenTofu
- Finding latest version of hashicorp/external...
- Reusing previous version of rackerlabs/spot from the dependency lock file
- Finding latest version of hashicorp/external...
- Installing hashicorp/external v2.3.5...
- Installing rackerlabs/spot v0.1.4...
- Installed hashicorp/external v2.3.5 (signed, key ID 0C0AF313E5FD9F80)
- Installing rackerlabs/spot v0.1.4...
- Installed rackerlabs/spot v0.1.4. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Installing hashicorp/external v2.3.5...
- Installed rackerlabs/spot v0.1.4. Signature validation was skipped due to the registry not containing GPG keys for this provider

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/external v2.3.5 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
spot_cloudspace.this: Refreshing state... [id=matchpoint-runners]
spot_spotnodepool.this: Refreshing state... [id=e79b74b3-b777-40c5-a5c8-426f39f8ce67]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

OpenTofu will perform the following actions:

  # data.external.kubeconfig will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "kubeconfig" {
      + id      = (known after apply)
      + program = [
          + "bash",
          + "./scripts/fetch-kubeconfig.sh",
        ]
      + query   = {
          + "cluster_name" = "matchpoint-runners-2"
        }
      + result  = (known after apply)
    }

  # spot_cloudspace.this will be created
  + resource "spot_cloudspace" "this" {
      + bids                  = (known after apply)
      + cloudspace_name       = "matchpoint-runners-2"
      + cni                   = "calico"
      + deployment_type       = "gen2"
      + first_ready_timestamp = (known after apply)
      + hacontrol_plane       = false
      + id                    = (known after apply)
      + kubernetes_version    = "1.31.1"
      + last_updated          = (known after apply)
      + name                  = (known after apply)
      + pending_allocations   = (known after apply)
      + region                = "us-central-dfw-1"
      + spotnodepool_ids      = (known after apply)
      + wait_until_ready      = false
    }

  # spot_spotnodepool.this will be created
  + resource "spot_spotnodepool" "this" {
      + autoscaling          = {
          + max_nodes = 12
          + min_nodes = 2
        }
      + bid_price            = 0.35
      + bid_status           = (known after apply)
      + cloudspace_name      = "matchpoint-runners-2"
      + desired_server_count = (known after apply)
      + id                   = (known after apply)
      + last_updated         = (known after apply)
      + name                 = (known after apply)
      + server_class         = "gp.vs1.xlarge-dfw"
      + won_count            = (known after apply)
    }

  # terraform_data.setup_spotctl_config will be created
  + resource "terraform_data" "setup_spotctl_config" {
      + id               = (known after apply)
      + triggers_replace = [
          + "matchpoint-runners-2",
        ]
    }

  # terraform_data.wait_for_cluster will be created
  + resource "terraform_data" "wait_for_cluster" {
      + id               = (known after apply)
      + triggers_replace = [
          + (known after apply),
        ]
    }

  # terraform_data.wait_for_nodepool will be created
  + resource "terraform_data" "wait_for_nodepool" {
      + id               = (known after apply)
      + triggers_replace = [
          + (known after apply),
        ]
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloudspace_name        = "matchpoint-runners-2"
  + cloudspace_status      = (known after apply)
  + cluster_ca_certificate = (sensitive value)
  + cluster_endpoint       = (known after apply)
  + cluster_token          = (sensitive value)
  + kubeconfig_raw         = (sensitive value)
  + node_scaling           = {
      + max = 12
      + min = 2
    }
  + nodepool_name          = (known after apply)
  + region                 = "us-central-dfw-1"
  + server_class           = "gp.vs1.xlarge-dfw"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.
terraform_data.setup_spotctl_config: Refreshing state... [id=28e19691-e59e-726f-789c-9b6a9601c876]
terraform_data.wait_for_cluster: Refreshing state... [id=00552ded-818c-a14d-9136-f383592e016c]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

OpenTofu will perform the following actions:

  # data.external.kubeconfig will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "kubeconfig" {
      + id      = (known after apply)
      + program = [
          + "bash",
          + "./scripts/fetch-kubeconfig.sh",
        ]
      + query   = {
          + "cluster_name" = "matchpoint-runners"
        }
      + result  = (known after apply)
    }

  # terraform_data.wait_for_nodepool will be created
  + resource "terraform_data" "wait_for_nodepool" {
      + id               = (known after apply)
      + triggers_replace = [
          + "e79b74b3-b777-40c5-a5c8-426f39f8ce67",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ cloudspace_status      = "Ready" -> (known after apply)
  ~ cluster_ca_certificate = (sensitive value)
  ~ cluster_endpoint       = "https://hcp-0ac06405-cc3a-4757-950a-2fa102a423d7.spot.rackspace.com" -> (known after apply)
  ~ cluster_token          = (sensitive value)
  ~ kubeconfig_raw         = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

Initializing the backend...

Successfully configured the backend "gcs"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing the backend...
- Installing hashicorp/helm v3.1.1...

Successfully configured the backend "gcs"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Installing hashicorp/kubernetes v3.0.1...
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Installing hashicorp/kubernetes v3.0.1...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Installing hashicorp/helm v3.1.1...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 600
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                "dex":
                  "enabled": false
                "repoServer":
                  "replicas": 1
                "server":
                  "service":
                    "type": "ClusterIP"
            EOT,
        ]
      + verify                     = false
      + version                    = "5.51.6"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_namespace_v1.argocd will be created
  + resource "kubernetes_namespace_v1" "argocd" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + argocd_chart_version = "5.51.6"
  + argocd_namespace     = "argocd"
  + argocd_release_name  = "argocd"
  + cluster_endpoint     = "https://mock-endpoint-secondary.example.com"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.
kubernetes_namespace_v1.argocd: Refreshing state... [id=argocd]
helm_release.argocd: Refreshing state... [id=argocd]

Initializing the backend...

Successfully configured the backend "gcs"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Installing hashicorp/kubernetes v3.0.1...

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu planned the following actions, but then encountered a problem:

  # kubernetes_namespace_v1.arc_runners will be created
  + resource "kubernetes_namespace_v1" "arc_runners" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "arc-runners"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace_v1.arc_systems will be created
  + resource "kubernetes_namespace_v1" "arc_systems" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "arc-systems"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret_v1.github_token will be created
  + resource "kubernetes_secret_v1" "github_token" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "arc-org-github-secret"
          + namespace        = "arc-runners"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + arc_controller_namespace = "arc-systems"
  + argocd_sync_source       = {
      + path            = "argocd/applications"
      + repo_url        = "https://github.com/Matchpoint-AI/project-beta-runners"
      + target_revision = "main"
    }
  + runner_namespace         = "arc-runners"

Error: Invalid configuration for API client

  with kubernetes_manifest.bootstrap_application,
  on main.tf line 78, in resource "kubernetes_manifest" "bootstrap_application":
  78: resource "kubernetes_manifest" "bootstrap_application" {

Get "https://mock-endpoint-secondary.example.com/apis": dial tcp: lookup
mock-endpoint-secondary.example.com on 127.0.0.53:53: no such host
time=2026-01-08T23:51:27Z level=error msg=tofu invocation failed in /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps-secondary/.terragrunt-cache/Qez7KQjx-h7FpS2lBKPcVy5SXZI/7qtnZhOKf8jj4Mdzdqf6V6nqxC8 prefix=[/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps-secondary] 
time=2026-01-08T23:51:27Z level=error msg=Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps-secondary has finished with an error: 1 error occurred:
	* [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps-secondary/.terragrunt-cache/Qez7KQjx-h7FpS2lBKPcVy5SXZI/7qtnZhOKf8jj4Mdzdqf6V6nqxC8] exit status 1

 prefix=[/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps-secondary] 
time=2026-01-08T23:51:27Z level=info msg=
Error: Invalid configuration for API client

  with kubernetes_manifest.bootstrap_application,
  on main.tf line 78, in resource "kubernetes_manifest" "bootstrap_application":
  78: resource "kubernetes_manifest" "bootstrap_application" {

Get "https://mock-endpoint-secondary.example.com/apis": dial tcp: lookup
mock-endpoint-secondary.example.com on 127.0.0.53:53: no such host
time=2026-01-08T23:51:27Z level=error msg=tofu invocation failed in /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps-secondary/.terragrunt-cache/Qez7KQjx-h7FpS2lBKPcVy5SXZI/7qtnZhOKf8jj4Mdzdqf6V6nqxC8 prefix=[/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps-secondary] 

time=2026-01-08T23:51:27Z level=error msg=1 error occurred:
	* [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps-secondary/.terragrunt-cache/Qez7KQjx-h7FpS2lBKPcVy5SXZI/7qtnZhOKf8jj4Mdzdqf6V6nqxC8] exit status 1


```
</details>